#### APAN5310 Project Checkpoint5

Import Required Packages

In [1]:
#!pip install faker

In [2]:
import pandas as pd
from sqlalchemy import create_engine, text
import numpy as np
import random
import datetime
import psycopg2
from faker import Faker
import string
from collections import Counter
import decimal

In [3]:
#!pip freeze > requirements.txt

Create connection to PostgreSQL

In [4]:
#Please add a new database in Postgre, and modify the following code to your own database connection, but the rest of the code should be the same.
conn = psycopg2.connect(
    host="localhost",
    database="5310_project_checkpoint5",
    user="postgres",
    password="123"
)

cur = conn.cursor()

Creating schemas by passing Project SQL codes:

In [5]:
#pass sql schemas statements
stmt = """
DROP TABLE IF EXISTS reviews;
DROP TABLE IF EXISTS car_rental_bookings;
DROP TABLE IF EXISTS hotel_bookings;
DROP TABLE IF EXISTS flight_bookings ;
DROP TABLE IF EXISTS user_preferences;
DROP TABLE IF EXISTS payment_information;
DROP TABLE IF EXISTS car_prices;
DROP TABLE IF EXISTS car_types;
DROP TABLE IF EXISTS rental_companies;
DROP TABLE IF EXISTS room_prices;
DROP TABLE IF EXISTS room_types;
DROP TABLE IF EXISTS hotels;
DROP TABLE IF EXISTS flight_prices;
DROP TABLE IF EXISTS airlines;
DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS locations;


-- locations table
CREATE TABLE locations (
    location_id SERIAL PRIMARY KEY,
    address VARCHAR(255) NOT NULL,
    city VARCHAR(255),
    state VARCHAR(255),
    country VARCHAR(255) NOT NULL
);

-- customers table
CREATE TABLE customers (
    customer_id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL,
    phone_number CHAR(10),
    loyalty_degree INTEGER CHECK (loyalty_degree BETWEEN 1 AND 5) NOT NULL,
    customer_address INTEGER NOT NULL,
    FOREIGN KEY (customer_address) REFERENCES locations(location_id)
);

-- airlines table
CREATE TABLE airlines (
    airline_id SERIAL PRIMARY KEY,
    airline_name VARCHAR(255) NOT NULL
);

-- flight_price table
CREATE TABLE flight_prices (
    flight_id SERIAL PRIMARY KEY,
    airline_id INTEGER NOT NULL,
    depart_airport CHAR(3) NOT NULL,
    depart_location INTEGER NOT NULL,
    destin_airport CHAR(3) NOT NULL,
    destin_location INTEGER NOT NULL,
    departure_time TIMESTAMP NOT NULL,
    arrival_time TIMESTAMP NOT NULL,
    duration INTERVAL NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
	discount_ratio DECIMAL(3, 2) NOT NULL,
    FOREIGN KEY (airline_id) REFERENCES airlines(airline_id),
    FOREIGN KEY (depart_location) REFERENCES locations(location_id),
    FOREIGN KEY (destin_location) REFERENCES locations(location_id)
);

-- hotels table
CREATE TABLE hotels (
    hotel_id SERIAL PRIMARY KEY,
    hotel_name VARCHAR(255) NOT NULL,
    hotel_address INTEGER NOT NULL,
    star_rating INTEGER NOT NULL,
    FOREIGN KEY (hotel_address) REFERENCES locations(location_id)
);

-- room_type table
CREATE TABLE room_types (
    room_type_id SERIAL PRIMARY KEY,
    room_type VARCHAR(255) NOT NULL UNIQUE,
    capacity INTEGER NOT NULL
);

-- room_price table
CREATE TABLE room_prices (
    hotel_id INTEGER,
    room_type_id INTEGER,
    price DECIMAL(10, 2),
    discount_ratio DECIMAL(3, 2),
    FOREIGN KEY (hotel_id) REFERENCES hotels(hotel_id),
    FOREIGN KEY (room_type_id) REFERENCES room_types(room_type_id)
);

-- rental_company table
CREATE TABLE rental_companies (
    rental_company_id SERIAL PRIMARY KEY,
    rental_company_name VARCHAR(255) NOT NULL,
    rental_company_address INTEGER NOT NULL,
    FOREIGN KEY (rental_company_address) REFERENCES locations(location_id)
);

-- car_type table
CREATE TABLE car_types (
    car_type_id SERIAL PRIMARY KEY,
    car_type VARCHAR(255) NOT NULL,
    manufacturer VARCHAR(255) NOT NULL,
    model VARCHAR(255) NOT NULL
);

CREATE TABLE car_prices (
    rental_company_id INTEGER,
    car_type_id INTEGER,
    price DECIMAL(10, 2),
    discount_ratio DECIMAL(3, 2),
    FOREIGN KEY (rental_company_id) REFERENCES rental_companies(rental_company_id),
    FOREIGN KEY (car_type_id) REFERENCES car_types(car_type_id)
);

-- payment_information table
CREATE TABLE payment_information (
    payment_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    card_details VARCHAR(19) NOT NULL,
    payment DECIMAL(10, 2) NOT NULL,
    billing_address INTEGER NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (billing_address) REFERENCES locations(location_id)
);

-- user_preferences table
CREATE TABLE user_preferences (
    customer_id INTEGER PRIMARY KEY,
    preferred_hotel_id INTEGER,
    preferred_car_model_id INTEGER,
    preferred_airline_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (preferred_hotel_id) REFERENCES hotels(hotel_id),
    FOREIGN KEY (preferred_car_model_id) REFERENCES car_types(car_type_id),
    FOREIGN KEY (preferred_airline_id) REFERENCES airlines(airline_id)
);

-- flight_bookings table
CREATE TABLE flight_bookings (
    booking_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    payment_id INTEGER NOT NULL,
    flight_id INTEGER,
    adults_count INTEGER,
    children_count INTEGER,
    booking_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (payment_id) REFERENCES payment_information(payment_id),
    FOREIGN KEY (flight_id) REFERENCES flight_prices(flight_id)
);

-- hotel_bookings table
CREATE TABLE hotel_bookings (
    booking_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    payment_id INTEGER NOT NULL,
    hotel_id INTEGER,
    room_type INTEGER,
    adults_count INTEGER,
    children_count INTEGER,
    check_in_date DATE,
    check_out_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (payment_id) REFERENCES payment_information(payment_id),
    FOREIGN KEY (hotel_id) REFERENCES hotels(hotel_id),
    FOREIGN KEY (room_type) REFERENCES room_types(room_type_id)
);

-- car_rental_bookings table
CREATE TABLE car_rental_bookings (
    booking_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    payment_id INTEGER NOT NULL,
    rental_company_id INTEGER,
    car_type INTEGER,
    adults_count INTEGER,
    children_count INTEGER,
    booking_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (payment_id) REFERENCES payment_information(payment_id),
    FOREIGN KEY (rental_company_id) REFERENCES rental_companies(rental_company_id),
    FOREIGN KEY (car_type) REFERENCES car_types(car_type_id)
);

-- reviews table
CREATE TABLE reviews (
    review_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    hotel_booking_id INTEGER,
    car_rental_booking_id INTEGER,
    flight_booking_id INTEGER,
    date DATE NOT NULL,
    review_text TEXT,
    review_score DECIMAL(2,1) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (hotel_booking_id) REFERENCES hotel_bookings(booking_id),
    FOREIGN KEY (car_rental_booking_id) REFERENCES car_rental_bookings(booking_id),
    FOREIGN KEY (flight_booking_id) REFERENCES flight_bookings(booking_id)
);
"""
cur.execute(stmt)
conn.commit()

In [6]:
cur.execute("SELECT * FROM reviews;")#now have no values in tables
cur.fetchall()

[]

Generate/insert data:
Since Online datasets can not sufficiently fulfill our data schemas, we will generate our own data to fill the data warehouse.

In [7]:
#we generated our own data in this part to make sure that our project is complete and accessiable in final submission/analysis.
#Our ETL pipeline is to show our project is feasible, and the data is only the means to the end.
#case on working with real world data will be demonstrated in later section.

#initiate the faker module
fake = Faker()

#in general, we will have 1000 rows of data in each table.
#some table takes more rows, and some returns less rows, but we will specify that later.
num_records = 1000

In [8]:
#eatablish a dictionary for the mapping of city and state
city_state_mapping = {
    'New York': 'New York',
    'New York': 'New York',
    'New York': 'New York',
    'Hempstead': 'New York',
    'Buffalo': 'New York',
    'Yonkers': 'New York',
    'Syracuse': 'New York',
    'Brookhaven': 'New York',
    'Los Angeles': 'California',
    'Chicago': 'Illinois',
    'Houston': 'Texas',
    'Miami': 'Florida',
    'San Francisco': 'California',
    'Boston': 'Massachusetts',
    'Seattle': 'Washington',
    'Dallas': 'Texas',
    'Denver': 'Colorado',
    'Austin': 'Texas',
    'Atlanta': 'Georgia',
    'Philadelphia': 'Pennsylvania',
    'Phoenix': 'Arizona',
    'San Antonio': 'Texas',
    'San Diego': 'California',
    'San Jose': 'California',
    'Indianapolis': 'Indiana',
    'Jacksonville': 'Florida',
    'Columbus': 'Ohio',
    'Charlotte': 'North Carolina',
    'Portland': 'Oregon',
    'Baltimore': 'Maryland',
    'Milwaukee': 'Wisconsin',
    'Tucson': 'Arizona',
    'Fresno': 'California',
    'Sacramento': 'California',
    'Kansas City': 'Missouri',
    'Long Beach': 'California',
    'Mesa': 'Arizona',
    'Atlanta': 'Georgia',
    'Colorado Springs': 'Colorado',
    'Virginia Beach': 'Virginia',
    'Raleigh': 'North Carolina',
    'Omaha': 'Nebraska',
    'Miami': 'Florida',
    'Oakland': 'California',
}
#many attribtues takes on values of locations, such as customer, hotel, rental company, and so on. 
#each of them need a unique location, therefore the location_records is set to be bigger than the num_records.
location_records = 4*num_records
#insert into locations table
for _ in range(location_records):
    address = fake.address().replace('\n', ', ').split(', ')[0]
    city, state = random.choice(list(city_state_mapping.items()))
    country = 'United States'
    sql = """
    INSERT INTO locations (address, city, state, country)
    VALUES (%s, %s, %s, %s);
    """
    cur.execute(sql, (address, city, state, country))
conn.commit()

In [9]:
cur.execute("SELECT location_id FROM locations")
location_ids = [id[0] for id in cur.fetchall()]#store all the location ids in a list, which can be used to ensure no duplication
customer_addresses = {}

#insert into customers table
for customer_id in range(1, (num_records+1)):
    first_name = fake.first_name()
    last_name = fake.last_name()
    email = fake.email()
    phone_number = fake.random_number(digits=10, fix_len=True)
    loyalty_degree = random.randint(1,5) 
    customer_address = random.choice(location_ids)  
    location_ids.remove(customer_address) # update address pool to avoid duplication

    sql = """
    INSERT INTO customers (first_name, last_name, email, phone_number, loyalty_degree, customer_address)
    VALUES (%s, %s, %s, %s, %s, %s);
    """

    cur.execute(sql, (first_name, last_name, email, phone_number, loyalty_degree, customer_address))
    customer_addresses[customer_id] = customer_address
    

conn.commit()

In [10]:
#copy paste some common airlines:
airline_names = ["Delta", "American Airlines", "United Airlines", "Southwest Airlines",
                 "Air Canada", "British Airways", "Lufthansa", "Air France",
                 "Japan Airlines", "Emirates", "Cathay Pacific", "Singapore Airlines",
                 "Qantas", "Ethiopian Airlines", "EgyptAir", "Kenya Airways",
                 "LATAM Airlines", "Aeroflot", "Turkish Airlines", "Etihad Airways"]

#insert into airlines table
for _ in range(len(airline_names)):
    airline_name = random.choice(airline_names)
    sql = """
    INSERT INTO airlines (airline_name)
    VALUES (%s);
    """

    cur.execute(sql, (airline_name,))

    airline_names.remove(airline_name)
conn.commit()

In [11]:
#obtain IATA airport codes
airports = { # Source: https://www.world-airport-codes.com/alphabetical/country-name/united-states.html
    'JFK': {'location': 'John F. Kennedy International Airport', 'city': 'New York', 'state': 'New York', 'country': 'USA'},
    'SFO': {'location': 'San Francisco International Airport', 'city': 'San Francisco', 'state': 'California', 'country': 'USA'},
    'LAX': {'location': 'Los Angeles International Airport', 'city': 'Los Angeles', 'state': 'California', 'country': 'USA'},
    'ATL': {'location': 'Hartsfield-Jackson Atlanta International Airport', 'city': 'Atlanta', 'state': 'Georgia', 'country': 'USA'},
    'ORD': {'location': 'Chicago O\'Hare International Airport', 'city': 'Chicago', 'state': 'Illinois', 'country': 'USA'},
    'DFW': {'location': 'Dallas/Fort Worth International Airport', 'city': 'Dallas/Fort Worth', 'state': 'Texas', 'country': 'USA'},
    'DEN': {'location': 'Denver International Airport', 'city': 'Denver', 'state': 'Colorado', 'country': 'USA'},
    'LAS': {'location': 'McCarran International Airport', 'city': 'Las Vegas', 'state': 'Nevada', 'country': 'USA'},
    'SEA': {'location': 'Seattle-Tacoma International Airport', 'city': 'Seattle', 'state': 'Washington', 'country': 'USA'},
    'MCO': {'location': 'Orlando International Airport', 'city': 'Orlando', 'state': 'Florida', 'country': 'USA'},
    'BHM': {'location': 'Birmingham-Shuttlesworth International Airport', 'city': 'Birmingham', 'state': 'Alabama', 'country': 'USA'},
    'ACV': {'location': 'Arcata-Eureka Airport', 'city': 'Arcata/Eureka', 'state': 'California', 'country': 'USA'},
    'BFL': {'location': 'Meadows Field Airport', 'city': 'Bakersfield', 'state': 'California', 'country': 'USA'},
    'BUR': {'location': 'Hollywood Burbank Airport', 'city': 'Burbank', 'state': 'California', 'country': 'USA'},
    'SAN': {'location': 'San Diego International Airport', 'city': 'San Diego', 'state': 'California', 'country': 'USA'},
    'DAB': {'location': 'Daytona Beach International Airport', 'city': 'Daytona Beach', 'state': 'Florida', 'country': 'USA'},
    'SAV': {'location': 'Savannah/Hilton Head International Airport', 'city': 'Savannah', 'state': 'Georgia', 'country': 'USA'},
    'BLV': {'location': 'Scott Air Force Base / MidAmerica St. Louis Airport', 'city': 'Belleville', 'state': 'Illinois', 'country': 'USA'},
    'IND': {'location': 'Indianapolis International Airport', 'city': 'Indianapolis', 'state': 'Indiana', 'country': 'USA'},
    'AEX': {'location': 'Alexandria International Airport', 'city': 'Alexandria', 'state': 'Louisiana', 'country': 'USA'},
}

#add airports locations to locations table
count = 0
for i in airports:
    address = airports[i]['location']
    city = airports[i]['city']
    state = airports[i]['state']
    country = 'United States'
    sql = """
    INSERT INTO locations (address, city, state, country)
    VALUES (%s, %s, %s, %s);
    """
    cur.execute(sql, (address, city, state, country))

    count += 1
    airports[i]['location_id'] = location_records + count
conn.commit()


#add data into flight_prices table
for _ in range(num_records):
    airline_id = random.randint(1, 20)
    #mannually fake the aiport codes, making popular airports more likely to be selected
    depart_airport = fake.random_element(elements=('JFK','JFK','JFK', 'SFO', 'SFO','LAX','LAX','LAX', 'ATL','ATL', 'ORD', 'DFW', 'DEN', 'DEN','LAS', 'SEA', 'MCO'))
    depart_location = airports[depart_airport]['location_id']
    destin_airport = fake.random_element(elements=('BHM', 'ACV', 'BFL', 'BUR', 'SAN', 'DAB', 'SAV', 'BLV', 'IND', 'AEX'))
    destin_location = airports[destin_airport]['location_id']
    departure_time = fake.date_time_this_year(after_now = True)
    duration = datetime.timedelta(minutes=random.randint(60, 9*60))  # Random duration between 60 minutes and 9 hours
    arrival_time = departure_time + duration
    
    #fake prices based on how long the flight is
    discount_ratio = round(random.uniform(0.1, 0.2), 2)
    if duration < datetime.timedelta(hours=2.25):
        price = round(random.uniform(50, 150), 2)
    elif duration < datetime.timedelta(hours=4.5):
        price = round(random.uniform(150, 250), 2)
    elif duration < datetime.timedelta(hours=6.75):
        price = round(random.uniform(250, 375), 2)
    else:
        price = round(random.uniform(375, 500), 2)

    sql = """
    INSERT INTO flight_prices (airline_id, depart_airport, depart_location, destin_airport, destin_location, departure_time, arrival_time, duration, price, discount_ratio)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s);
    """

    cur.execute(sql, (airline_id, depart_airport, depart_location, destin_airport, destin_location, departure_time, arrival_time, str(duration), price, discount_ratio))

conn.commit()

In [12]:
#obtain general hotel names/rating
hotel_names_ratings = {
'Marriott': 5, 'Hilton': 5, 'Hyatt': 5, 'Sheraton': 4, 'Westin': 4,
'Holiday Inn': 3, 'Radisson': 4, 'Best Western': 3, 'Four Seasons': 5, 'InterContinental': 5,
'Ritz-Carlton': 5, 'Fairmont': 5, 'Shangri-La': 5, 'Mandarin Oriental': 5, 'Sofitel': 5,
'Swissotel': 4, 'Waldorf Astoria': 5, 'Crowne Plaza': 4, 'Kimpton Hotels': 4, 'Novotel': 4,
'Mercure': 3, 'Ibis': 3, 'Aloft': 3, 'Le Meridien': 4, 'W Hotels': 4,
'St. Regis': 5, 'Renaissance': 4, 'Courtyard': 3, 'SpringHill Suites': 3, 'Residence Inn': 3,
'Hampton Inn': 3, 'DoubleTree': 4, 'Embassy Suites': 3, 'Conrad': 5, 'Omni Hotels': 4,
'Motel 6': 2, 'Super 8': 2, 'Travelodge': 2, 'Red Roof Inn': 2, 'La Quinta': 3,
'Comfort Inn': 3, 'Quality Inn': 3, 'Econo Lodge': 2, 'Rodeway Inn': 2, 'Days Inn': 2,
'Howard Johnson': 2, 'Knights Inn': 2, 'Sleep Inn': 2, 'MainStay Suites': 3, 'Microtel Inn & Suites': 3
}
#insert hotel names/rating into hotels table
for _ in range(num_records):
    hotel_name, star_rating = random.choice(list(hotel_names_ratings.items())) 
    hotel_address = random.choice(location_ids)  
    location_ids.remove(hotel_address)

    sql = """
    INSERT INTO hotels (hotel_name, hotel_address, star_rating)
    VALUES (%s, %s, %s);
    """

    cur.execute(sql, (hotel_name, hotel_address, star_rating))

conn.commit()

In [13]:
#common room types and capacities
room_types = ['Single', 'Double', 'Suite', 'Family', 'Deluxe']
capacities = [1, 2, 3, 4, 5]

#insert room types and capacities into room_types table
for _ in range(len(room_types)):
    room_type = room_types[_]
    capacity = capacities[_]
    
    sql = """
    INSERT INTO room_types (room_type, capacity)
    VALUES (%s, %s);
    """
    cur.execute(sql, (room_type, capacity))
conn.commit()

In [14]:
cur.execute("SELECT hotel_id FROM hotels")
hotel_ids = [id[0] for id in cur.fetchall()]

# Insert into room prices table
for _ in range(num_records):
    hotel_id = random.choice(hotel_ids)
    room_type_id = random.randint(1, 5)
    #adjusting room prices based on room type
    if room_type_id <= 2:
        price = round(random.uniform(100, 500), 2)
    elif room_type_id < 4:
        price = round(random.uniform(200, 800), 2)
    else:
        price = round(random.uniform(300, 1000), 2)
    discount_ratio = round(random.uniform(0.1, 0.2), 2)

    sql = """
    INSERT INTO room_prices (hotel_id, room_type_id, price, discount_ratio)
    VALUES (%s, %s, %s, %s);
    """
    cur.execute(sql, (hotel_id, room_type_id, price, discount_ratio))
conn.commit()

In [15]:
#insert into rental_companies table
for _ in range(num_records):
    rental_company_name = fake.company()
    rental_company_address = random.choice(location_ids)  
    location_ids.remove(rental_company_address)
    
    sql = """
    INSERT INTO rental_companies (rental_company_name, rental_company_address)
    VALUES (%s, %s);
    """
    cur.execute(sql, (rental_company_name, rental_company_address))
conn.commit()

In [16]:
car_types = ['Sedan', 'SUV', 'Hatchback', 'Convertible', 'Sports']
manufacturers = ['Toyota', 'Ford', 'Honda', 'Chevrolet', 'Tesla']

def random_model():#fake model number generator
    letter = random.choice(string.ascii_uppercase) 
    number = random.randint(1, 15)
    return f'{letter}{number}'

#set number of records to be inserted into car types table
car_type_records = 10
# Insert into car types table
for _ in range(car_type_records):
    car_type = car_types[random.randint(0, 4)]
    manufacturer = random.choice(manufacturers)
    model = random_model()

    sql = """
    INSERT INTO car_types (car_type, manufacturer, model)
    VALUES (%s, %s, %s);
    """
    cur.execute(sql, (car_type, manufacturer, model))
conn.commit()

In [17]:
#insert into car_prices table
for _ in range(num_records):
    rental_company_id = random.randint(1, num_records)
    car_type_id = random.randint(1, car_type_records)
    
    price = round(random.uniform(100, 500), 2)
    discount_ratio = round(random.uniform(0.1, 0.2), 2)

    sql = """
    INSERT INTO car_prices (rental_company_id, car_type_id, price, discount_ratio)
    VALUES (%s, %s, %s, %s);
    """
    cur.execute(sql, (rental_company_id, car_type_id, price, discount_ratio))
conn.commit()

The normalization of the database design may require additional queries to retrieve certain related attributes. For example, having the customer_id, it might be required to go through the customer table to retrieve the customer_name, and all three other booking tables to obtain each customer's booking history. Therefore:

In [18]:
#get flight_id and price from query(existing database) into pandas dataframe
#the following steps will insert data by using existing, common attributes. This restores the relationships between different tables
#this also ensures the consistency of database, which further ensures the accuracy and feasibility of our project design using generated data
cur.execute("SELECT flight_id,price,discount_ratio FROM flight_prices")
flight_df = pd.DataFrame(cur.fetchall(),columns = ['flight_id','price','discount_ratio'])
#make price column equal to price*discount_ratio, this is the actual price that customers paied(store in payment table)
flight_df['price'] = flight_df.apply(lambda row: round(row['price'] * (1 - row['discount_ratio']), 2), axis=1)
flight_df = flight_df.drop(columns = ['discount_ratio'])
flight_df.info()

#do the saame for hotel room_prices and rental car_prices
cur.execute("SELECT * FROM room_prices")
hotel_df = pd.DataFrame(cur.fetchall(), columns = ['hotel_id', 'room_type_id', 'price', 'discount_ratio'])
hotel_df['price'] = hotel_df.apply(lambda row: round(row['price'] * (1 - row['discount_ratio']),2), axis = 1)
hotel_df = hotel_df.drop(columns = ['discount_ratio'])
hotel_df.info()

cur.execute("SELECT * FROM car_prices")
car_df = pd.DataFrame(cur.fetchall(), columns = ['rental_company_id', 'car_type_id', 'price', 'discount_ratio'])
car_df['price'] = car_df.apply(lambda row: round(row['price'] * (1 - row['discount_ratio']),2), axis = 1)
car_df = car_df.drop(columns = ['discount_ratio'])
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   flight_id  1000 non-null   int64
 1   price      1000 non-null   object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   hotel_id      1000 non-null   int64
 1   room_type_id  1000 non-null   int64
 2   price         1000 non-null   object
dtypes: int64(2), object(1)
memory usage: 23.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   rental_company_id  1000 non-null   int64
 1   car_type_id        1000 non-null   int64
 2   price              1000 non-null   object
dtypes: int64(2), object(1)
memory usage: 23.6+ KB

In [19]:
# create a price list that contains all price rows from flight,hotel,and car.
price_list = []
for i in range(len(flight_df['price'])):
    price_list.append(float(flight_df['price'][i]))

for i in range(len(hotel_df['price'])):
    price_list.append(float(hotel_df['price'][i]))

for i in range(len(car_df['price'])):
    price_list.append(float(car_df['price'][i]))


price_counts = Counter(price_list)
unique_prices = [num for num in price_list if price_counts[num] == 1]

len(unique_prices)
#we will be drawing random prices from this list to create payment information. 
#However, as shown in further below, the reason of using 'unique' price here is that 
#we can use them as unique identifiers for each transaction(retrieving information such as the room_types, flight_id, etc)
#essentially, this method ensures each datapoint from each table is connected with its related attributes in other table

2827

In [20]:
#insert into payment_information table
for i in range(5 * num_records):  # Define how many records to create, choose x * num_records to mimic the fact that a customer might have purchased multiple services
    #get a random customer
    customer_id = random.randint(1, num_records)  
    card_details = fake.credit_card_number('visa')
    # Get a random price from the list of unique prices
    payment = random.choice(unique_prices)
    billing_address = customer_addresses[customer_id]  #Get the address for this customer

    sql = """
    INSERT INTO payment_information (customer_id, card_details, payment, billing_address)
    VALUES (%s, %s, %s, %s);
    """
    cur.execute(sql, (customer_id, card_details, payment, billing_address))
conn.commit()
#note that the assignment in this table insertion is just adding random customers to exisiting payments(fake orders).
#using random customer ids, we mimicks the phenomenon that a customer might have purchased multiple services in realworld.

In [21]:
#retrieve existing payment data from database
cur.execute("SELECT * FROM payment_information")
payment_df = pd.DataFrame(cur.fetchall(),columns = ['payment_id','customer_id','card_details','payment','billing_address'])
payment_df['payment'] = payment_df['payment'].astype(float)

flight_df['price'] = flight_df['price'].astype(float)

#insert into flight_bookings table
for i in flight_df['price']:
    if i in payment_df['payment'].values:
        #if a flight price value matches a payment value, insert into flight_bookings table. While doing this, connect the flight to a payment information of an order.
        #this mimcks a customer booking a flight and paying for it. This is the same in below cells where inserting for hotel bookings and car rentals.
        payment_id = payment_df['payment_id'][payment_df['payment'] == i].values[0]
        customer_id = payment_df['customer_id'][payment_df['payment'] == i].values[0]
        flight_id = flight_df['flight_id'][flight_df['price'] == i].values[0]
        #randomly generate number of adults and children for each booking
        adults_count = random.randint(1, 5)
        children_count = random.randint(0, 5)
        booking_date = fake.date_this_year(after_today = True)
        
        sql = """
        INSERT INTO flight_bookings (customer_id, payment_id, flight_id, adults_count, children_count, booking_date)
        VALUES (%s, %s, %s, %s, %s, %s);
        """
        cur.execute(sql, (int(customer_id), int(payment_id), int(flight_id), adults_count, children_count, booking_date))
conn.commit()

In [22]:
hotel_df['price'] = hotel_df['price'].astype(float)
for i in hotel_df['price']:
    if i in payment_df['payment'].values:
        payment_id = payment_df['payment_id'][payment_df['payment'] == i].values[0]
        customer_id = payment_df['customer_id'][payment_df['payment'] == i].values[0]
        hotel_id = hotel_df['hotel_id'][hotel_df['price'] == i].values[0]
        room_type = hotel_df['room_type_id'][hotel_df['price'] == i].values[0]
        adults_count = random.randint(1, 5)
        children_count = random.randint(0, 5)
        check_in_date = fake.date_this_year(after_today = True)
        check_out_date = check_in_date + datetime.timedelta(days=random.randint(2, 9))
        
        sql = """
        INSERT INTO hotel_bookings (customer_id, payment_id, hotel_id, room_type, adults_count, children_count, check_in_date, check_out_date)
        VALUES (%s, %s, %s, %s, %s, %s, %s, %s);
        """
        cur.execute(sql, (int(customer_id), int(payment_id), int(hotel_id), int(room_type), adults_count, children_count, check_in_date, check_out_date))
conn.commit()

In [23]:
car_df['price'] = car_df['price'].astype(float)
for i in car_df['price']:
    if i in payment_df['payment'].values:
        payment_id = payment_df['payment_id'][payment_df['payment'] == i].values[0]
        customer_id = payment_df['customer_id'][payment_df['payment'] == i].values[0]
        rental_company_id = car_df['rental_company_id'][car_df['price'] == i].values[0]
        car_type = car_df['car_type_id'][car_df['price'] == i].values[0]
        adults_count = random.randint(1, 5)
        children_count = random.randint(0, 5)
        booking_date = fake.date_this_year(after_today = True)
        
        sql = """
        INSERT INTO car_rental_bookings (customer_id, payment_id, rental_company_id, car_type, adults_count, children_count, booking_date)
        VALUES (%s, %s, %s, %s, %s, %s, %s);
        """
        cur.execute(sql, (int(customer_id), int(payment_id), int(rental_company_id), int(car_type), adults_count, children_count, booking_date))
conn.commit()

In [24]:
#this part is to show that our ETL pipeline is capable of handling real world datasets
#since it is hard to generate text format reviews, we leverage a dataset found on kaggle called Hotel_Reviews.csv, to fulfill this task.
df = pd.read_csv('Hotel_Reviews.csv')
#EDA
df.head()
df.info()
df.describe()

positive_reviews = df['Positive_Review'].tolist()
negative_reviews = df['Negative_Review'].tolist()
dates =  df['Review_Date'].tolist()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515738 entries, 0 to 515737
Data columns (total 17 columns):
 #   Column                                      Non-Null Count   Dtype
---  ------                                      --------------   -----
 0   Hotel_Address                               515738 non-null  object
 1   Additional_Number_of_Scoring                515738 non-null  int64
 2   Review_Date                                 515738 non-null  object
 3   Average_Score                               515738 non-null  float64
 4   Hotel_Name                                  515738 non-null  object
 5   Reviewer_Nationality                        515738 non-null  object
 6   Negative_Review                             515738 non-null  object
 7   Review_Total_Negative_Word_Counts           515738 non-null  int64
 8   Total_Number_of_Reviews                     515738 non-null  int64
 9   Positive_Review                             515738 non-null  object
 10  Review_Total_Positive_Word_Counts           515738 non-null  int64
 11  Total_Number_of_Reviews_Reviewer_Has_Given  515738 non-null  int64
 12  Reviewer_Score                              515738 non-null  float64
 13  Tags                                        515738 non-null  object
 14  days_since_review                           515738 non-null  object
 15  lat                                         512470 non-null  float64
 16  lng                                         512470 non-null  float64
dtypes: float64(4), int64(5), object(8)
memory usage: 66.9+ MB

In [25]:
#same as before, obtain exisitng data from database to ensure consistency
cur.execute("SELECT * FROM flight_bookings")
flight_booking_df = pd.DataFrame(cur.fetchall(),columns = ['booking_id','customer_id','payment_id','flight_id','adults_count','children_count','booking_date'])
cur.execute("SELECT * FROM hotel_bookings")
hotel_booking_df = pd.DataFrame(cur.fetchall(),columns = ['booking_id','customer_id','payment_id','hotel_id','room_type','adults_count','children_count','check_in_date','check_out_date'])
cur.execute("SELECT * FROM car_rental_bookings")
car_bookings_df = pd.DataFrame(cur.fetchall(),columns = ['booking_id','customer_id','payment_id','rental_company_id','car_type','adults_count','children_count','car_rental_bookings'])

#insert into reviews table
for i in range(len(hotel_booking_df['booking_id'])):
    #set a fake review date
    date = fake.date_this_year(after_today = True)
    #check if the review date is after the customer's check out date
    if hotel_booking_df['check_out_date'][i] < date:
        customer_id = int(hotel_booking_df['customer_id'][i])
        hotel_booking_id = int(hotel_booking_df['booking_id'][i])
        #check if the customer, besides hotel order, have any other orders
        if customer_id in car_bookings_df['customer_id'].values:
            car_rental_booking_id = int(car_bookings_df[car_bookings_df['customer_id'] == customer_id]['booking_id'].values[0])
        else:
            car_rental_booking_id = None

        if customer_id in flight_booking_df['customer_id'].values:
            flight_booking_id = int(flight_booking_df[flight_booking_df['customer_id'] == customer_id]['booking_id'].values[0])
        else:
            flight_booking_id = None

        #set a random review score and review text
        review_score = round(random.uniform(0, 9.9), 1)
        if review_score >= 5.0:
            review_text = random.choice(positive_reviews)
        else:
            review_text = random.choice(negative_reviews)
            
        sql = """
        INSERT INTO reviews (customer_id, hotel_booking_id, car_rental_booking_id, flight_booking_id, date, review_text, review_score)
        VALUES (%s, %s, %s, %s, %s, %s, %s);
        """
        cur.execute(sql, (customer_id, hotel_booking_id, car_rental_booking_id, flight_booking_id, date, review_text, review_score))
conn.commit()

In [26]:
cur.close()
conn.close()

#### Business Intelligence #### 
Queries that will be used for visualizations for the business intelligence team.

- Customer Preferences: This query reveals customer preferences for airline companies, hotels and rental car types, helping understand what kind of services customers tend to choose. This can be highly beneficial for marketing and promotional activities.

In [27]:
#Write the query that returns 
#Q1: What is each customer's preferred(most booked) booking hotel, car rental, and flights?
#Those will be the 'preferred_hotel_id ', 'preferred_car_model_id ', and 'preferred_airline_id ' that will be stored in the user_preferences table
stmt = """
DROP TABLE IF EXISTS user_preferences;
SELECT
  customer_id,
  (
    SELECT hotel_id
    FROM hotel_bookings hb
    WHERE hb.customer_id = c.customer_id
    GROUP BY hotel_id
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_hotel_id,
  (
    SELECT car_type
    FROM car_rental_bookings crb
    WHERE crb.customer_id = c.customer_id
    GROUP BY car_type
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_car_model_id,
  (
    SELECT airline_id
    FROM flight_bookings fb
    JOIN flight_prices fp ON fb.flight_id = fp.flight_id
    WHERE fb.customer_id = c.customer_id
    GROUP BY airline_id
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_airline_id
FROM customers c;
"""

#push the preferences_df dataframe to the database
#it will be easier to do this in pandas than in SQL, therefore use sqlalchemy
conn_url = 'postgresql://postgres:123@localhost:5432/5310_project_checkpoint5'
engine = create_engine(conn_url)
#establish a connection
connection = engine.connect()
preferences_df = connection.execute(stmt).fetchall()

preferences_df = pd.DataFrame(preferences_df, columns=['customer_id', 'preferred_hotel_id', 'preferred_car_model_id', 'preferred_airline_id'])
preferences_df.to_sql('user_preferences', con=engine, if_exists='append', index=False)

#print the first 20 rows of the user_preferences table
stmt = """
SELECT
  customer_id,
  (
    SELECT hotel_name
    FROM hotel_bookings hb
    JOIN hotels h ON hb.hotel_id = h.hotel_id
    WHERE hb.customer_id = c.customer_id
    GROUP BY hotel_name
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_hotel_name,
  (
    SELECT ct.car_type
    FROM car_rental_bookings crb
    JOIN car_types ct ON crb.car_type = ct.car_type_id
    WHERE crb.customer_id = c.customer_id
    GROUP BY ct.car_type
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_car_model,
  (
    SELECT airline_name
    FROM flight_bookings fb
    JOIN flight_prices fp ON fb.flight_id = fp.flight_id
    JOIN airlines a ON fp.airline_id = a.airline_id
    WHERE fb.customer_id = c.customer_id
    GROUP BY airline_name
    ORDER BY COUNT(*) DESC
    LIMIT 1
  ) AS preferred_airline_name
FROM customers c;

"""
temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['customer_id', 'preferred_hotel_id', 'preferred_car_model_id', 'preferred_airline_id'])
temp_df

,customer_id,preferred_hotel_id,preferred_car_model_id,preferred_airline_id
0,1,Hyatt,Sedan,Aeroflot
1,2,None,None,Kenya Airways
2,3,Radisson,None,American Airlines
3,4,None,Sports,LATAM Airlines
4,5,Hilton,Convertible,Aeroflot
...,...,...,...,...
995,996,None,None,Aeroflot
996,997,None,None,None
997,998,None,None,None
998,999,Red Roof Inn,Convertible,None
999,1000,Four Seasons,Sports,None

In [28]:
#Q2: Finding the top 5 travel destinations based on the number of flight bookings
stmt = """
SELECT locations.city, locations.country,
       COUNT(flight_bookings.flight_id) AS bookings_count,
       AVG(flight_prices.price) AS average_price,
       AVG(flight_prices.discount_ratio) AS average_discount_ratio,
       AVG(CASE WHEN EXTRACT(MONTH FROM flight_bookings.booking_date) BETWEEN 6 AND 8 THEN 1 ELSE 0 END) AS summer_bookings_ratio
FROM locations
JOIN flight_prices ON locations.location_id = flight_prices.destin_location
JOIN flight_bookings ON flight_prices.flight_id = flight_bookings.flight_id
WHERE flight_bookings.booking_date >= NOW() - INTERVAL '12 months'
GROUP BY locations.city, locations.country
ORDER BY bookings_count DESC
LIMIT 5;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['city', 'country', 'bookings_count', 'average_price', 'average_discount_ratio', 'summer_bookings_ratio'])
temp_df

,city,country,bookings_count,average_price,average_discount_ratio,summer_bookings_ratio
0,Alexandria,United States,94,290.2185106382978723,0.15425531914893617021,0.19148936170212765957
1,Birmingham,United States,88,295.6038636363636364,0.15204545454545454545,0.28409090909090909091
2,Indianapolis,United States,83,275.0960240963855422,0.15361445783132530120,0.21686746987951807229
3,Belleville,United States,82,273.7924390243902439,0.15073170731707317073,0.25609756097560975610
4,Savannah,United States,82,290.1140243902439024,0.15792682926829268293,0.19512195121951219512

The following queryï¼š
- Sales Analysis: This query provides the sales quantity for each airline company. It helps identify which airlines are performing strongly and have higher sales volumes in the market.
- Market Share: By comparing the sales quantities of different airline companies, it allows analysis of each airline company's market share. This is valuable for understanding the competitive landscape and market leadership positions.
- Sales Strategy: Understanding which airline companies have good sales performance can help analyze their sales and pricing strategies, providing insights for other airlines or travel agents on how to improve their sales.

In [29]:
#Q3: How does each airline perform in terms of sales and discounts? Which airline has the most sales?
stmt = """
SELECT 
    airlines.airline_name,
    COUNT(flight_bookings.booking_id) AS flight_sales_count,
    AVG(flight_prices.price) AS average_flight_price,
    AVG(flight_prices.discount_ratio) AS average_discount_ratio,
    SUM(CASE WHEN EXTRACT(MONTH FROM flight_bookings.booking_date) BETWEEN 6 AND 8 THEN 1 ELSE 0 END) AS summer_sales_count,
    locations.country AS top_destination_country
FROM 
    airlines
    JOIN flight_prices ON airlines.airline_id = flight_prices.airline_id
    JOIN flight_bookings ON flight_prices.flight_id = flight_bookings.flight_id
    JOIN locations ON flight_prices.destin_location = locations.location_id
GROUP BY 
    airlines.airline_name, locations.country
ORDER BY 
    flight_sales_count DESC, top_destination_country;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['airline_name', 'flight_sales_count', 'average_flight_price', 'average_discount_ratio', 'summer_sales_count', 'top_destination_country'])
temp_df

,airline_name,flight_sales_count,average_flight_price,average_discount_ratio,summer_sales_count,top_destination_country
0,American Airlines,56,281.0528571428571429,0.15696428571428571429,18,United States
1,Air Canada,53,263.5233962264150943,0.14754716981132075472,11,United States
2,Air France,47,289.2965957446808511,0.15170212765957446809,13,United States
3,Kenya Airways,44,312.4995454545454545,0.14568181818181818182,11,United States
4,Etihad Airways,44,255.8979545454545455,0.15090909090909090909,12,United States
5,Delta,43,265.6558139534883721,0.14395348837209302326,13,United States
6,Turkish Airlines,38,283.3700000000000000,0.15236842105263157895,5,United States
7,Aeroflot,38,305.5497368421052632,0.15473684210526315789,11,United States
8,Singapore Airlines,38,269.5326315789473684,0.15052631578947368421,9,United States
9,Qantas,38,258.4728947368421053,0.15605263157894736842,6,United States
10,LATAM Airlines,37,295.8694594594594595,0.15729729729729729730,10,United States
11,Cathay Pacific,36,293.6250000000000000,0.15388888888888888889,9,United States
12,British Airways,34,268.5029411764705882,0.15352941176470588235,8,United States
13,Emirates,34,291.0117647058823529,0.14794117647058823529,8,United States
14,EgyptAir,33,334.9772727272727273,0.15242424242424242424,7,United States
15,Japan Airlines,33,282.0957575757575758,0.15515151515151515152,8,United States
16,United Airlines,33,284.8560606060606061,0.14909090909090909091,8,United States
17,Lufthansa,31,307.0145161290322581,0.14419354838709677419,10,United States
18,Southwest Airlines,31,315.4635483870967742,0.16709677419354838710,6,United States
19,Ethiopian Airlines,28,273.0732142857142857,0.14428571428571428571,6,United States

The following query:
- Customer Segmentation: This query provides customer segmentation information based on loyalty and past purchasing behavior. By understanding customer loyalty and purchasing patterns, companies can more accurately target their marketing activities.

- Understanding Loyalty: Analyzing the relationship between loyalty and purchasing behavior helps understand which customers are more likely to become repeat buyers. This can guide loyalty programs and incentive strategies.

- Cross-Selling Opportunities: Understanding customers' purchasing patterns across flights, hotels, and car rentals can reveal cross-selling and bundling opportunities.

- Personalized Marketing: By understanding customers' purchase history and loyalty, companies can create more personalized marketing and promotional campaigns to increase customer engagement and satisfaction.

In [30]:
#Q4: How is the loyalty degree of a customer related to the number of purchases they make in each category?
stmt = """
SELECT 
    customers.customer_id,
    customers.loyalty_degree,
    COUNT(flight_bookings.booking_id) AS flight_purchases,
    COUNT(hotel_bookings.booking_id) AS hotel_purchases,
    COUNT(car_rental_bookings.booking_id) AS car_rental_purchases
FROM 
    customers
    LEFT JOIN flight_bookings ON customers.customer_id = flight_bookings.customer_id
    LEFT JOIN hotel_bookings ON customers.customer_id = hotel_bookings.customer_id
    LEFT JOIN car_rental_bookings ON customers.customer_id = car_rental_bookings.customer_id
GROUP BY 
    customers.customer_id,
    customers.loyalty_degree
ORDER BY customers.customer_id;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['customer_id', 'loyalty_degree', 'flight_purchases', 'hotel_purchases', 'car_rental_purchases'])
temp_df

,customer_id,loyalty_degree,flight_purchases,hotel_purchases,car_rental_purchases
0,1,2,4,4,4
1,2,1,2,0,0
2,3,5,1,1,0
3,4,3,9,0,9
4,5,3,1,1,1
...,...,...,...,...,...
995,996,4,1,0,0
996,997,5,0,0,0
997,998,4,0,0,0
998,999,2,0,2,2
999,1000,2,0,1,1

The following query:
- Distinuishes two categories reviews, positive and negative, based on the rating scores of flights and hotels.
- Listed the highest score and lowest score of each category and each service type.
- Retrieved the corresponding hotel name and airline name for the highest and lowest score of each category and each service type.
- Summarized the satisfaction level of each service type for each category.
- Can be potentially used for further sentiment analysis.

In [31]:
#Q5: analyzing reviews, what are the average review score for positve/negative reviews, and what are the highest/lowest review scores for hotel and flight services?
stmt = """
WITH review_analysis AS (
    SELECT 
        review_category,
        COUNT(*) AS total_reviews,
        AVG(review_score) AS average_review_score,
        SUM(CASE WHEN review_score >= 7 THEN 1 ELSE 0 END) AS positive_reviews,
        SUM(CASE WHEN review_score < 4 THEN 1 ELSE 0 END) AS negative_reviews,
        MAX(review_score) AS highest_review_score,
        MIN(review_score) AS lowest_review_score,
        (
            SELECT flight_prices.flight_id 
            FROM reviews 
            JOIN flight_bookings ON reviews.flight_booking_id = flight_bookings.booking_id
            JOIN flight_prices ON flight_bookings.flight_id = flight_prices.flight_id
            WHERE review_category = 'Flight' 
            ORDER BY review_score DESC 
            LIMIT 1
        ) AS highest_flight_id,
        (
            SELECT hotels.hotel_name 
            FROM reviews 
            JOIN hotel_bookings ON reviews.hotel_booking_id = hotel_bookings.booking_id
            JOIN hotels ON hotel_bookings.hotel_id = hotels.hotel_id
            WHERE review_category = 'Hotel'
            ORDER BY review_score DESC 
            LIMIT 1
        ) AS best_hotel,
        (
            SELECT flight_prices.flight_id 
            FROM reviews 
            JOIN flight_bookings ON reviews.flight_booking_id = flight_bookings.booking_id
            JOIN flight_prices ON flight_bookings.flight_id = flight_prices.flight_id
            WHERE review_category = 'Flight' 
            ORDER BY review_score ASC 
            LIMIT 1
        ) AS lowest_flight_id,
        (
            SELECT hotels.hotel_name 
            FROM reviews 
            JOIN hotel_bookings ON reviews.hotel_booking_id = hotel_bookings.booking_id
            JOIN hotels ON hotel_bookings.hotel_id = hotels.hotel_id
            WHERE review_category = 'Hotel'
            ORDER BY review_score ASC 
            LIMIT 1
        ) AS worst_hotel
    FROM (
        SELECT 
            CASE 
                WHEN flight_booking_id IS NOT NULL THEN 'Flight'
                WHEN hotel_booking_id IS NOT NULL THEN 'Hotel'
                WHEN car_rental_booking_id IS NOT NULL THEN 'Car Rental'
                ELSE 'Unknown' 
            END AS review_category,
            review_score
        FROM 
            reviews
    ) AS sub_reviews
    GROUP BY 
        review_category
)
SELECT 
    review_category,
    total_reviews,
    average_review_score,
    positive_reviews,
    negative_reviews,
    highest_review_score,
    lowest_review_score,
    highest_flight_id,
    (
        SELECT airline_name
        FROM flight_prices fp
        JOIN airlines a ON fp.airline_id = a.airline_id
        WHERE fp.flight_id = review_analysis.highest_flight_id
    ) AS highest_flight_airline,
    best_hotel,
    lowest_flight_id,
    (
        SELECT airline_name
        FROM flight_prices fp
        JOIN airlines a ON fp.airline_id = a.airline_id
        WHERE fp.flight_id = review_analysis.lowest_flight_id
    ) AS lowest_flight_airline,
    worst_hotel,
    CASE 
        WHEN average_review_score >= 8 THEN 'Highly Satisfactory'
        WHEN average_review_score >= 5 AND average_review_score < 8 THEN 'Moderately Satisfactory'
        ELSE 'Needs Improvement'
    END AS satisfaction_level
FROM review_analysis
ORDER BY average_review_score DESC;

"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['Review Category', 'Total Reviews', 'Average Review Score', 'Positive Reviews', 'Negative Reviews', 'Highest Review Score', 'Lowest Review Score', 'Highest Flight ID', 'Best Flight Airline', 'Best Hotel', 'Lowest Flight ID', 'Worst Flight Airline', 'Worst Hotel', 'Satisfaction Level'])
temp_df

,Review Category,Total Reviews,Average Review Score,Positive Reviews,Negative Reviews,Highest Review Score,Lowest Review Score,Highest Flight ID,Best Flight Airline,Best Hotel,Lowest Flight ID,Worst Flight Airline,Worst Hotel,Satisfaction Level
0,Flight,218,4.7857798165137615,61,88,9.9,0.0,121.0,Aeroflot,None,53.0,LATAM Airlines,None,Needs Improvement
1,Hotel,186,4.7193548387096774,41,76,9.8,0.0,NaN,None,La Quinta,NaN,None,Ritz-Carlton,Needs Improvement

The following query:
- This query provides an in-depth understanding of flight prices, by analyzing the price trends across different months to reveal changes in seasonal demand. This can guide ticket sales management, pricing, and sales strategies.

In [32]:
#Q6: what is the connection between a period of time in a year, and the flight sales statistics, such as number of flights and the average price?
stmt = """
SELECT 
    TO_CHAR(departure_time, 'Month') AS month,
    EXTRACT(MONTH FROM departure_time) AS month_number,
    COUNT(flight_id) AS number_of_flights,
    AVG(price) AS average_price,
    AVG(discount_ratio) AS average_discount_ratio
FROM 
    flight_prices
GROUP BY 
    TO_CHAR(departure_time, 'Month'), EXTRACT(MONTH FROM departure_time)
ORDER BY
    month_number;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['month', 'month_number', 'number_of_flights', 'average_price', 'average_discount_ratio'])
temp_df

,month,month_number,number_of_flights,average_price,average_discount_ratio
0,January,1,99,290.3696969696969697,0.14929292929292929293
1,February,2,71,275.5480281690140845,0.14549295774647887324
2,March,3,90,281.3435555555555556,0.15477777777777777778
3,April,4,81,316.0772839506172840,0.15419753086419753086
4,May,5,89,297.6014606741573034,0.15348314606741573034
5,June,6,91,284.2514285714285714,0.15582417582417582418
6,July,7,89,267.9352808988764045,0.15617977528089887640
7,August,8,68,286.9002941176470588,0.14279411764705882353
8,September,9,69,290.6995652173913043,0.15072463768115942029
9,October,10,81,295.1035802469135802,0.14876543209876543210
10,November,11,88,273.5355681818181818,0.15193181818181818182
11,December,12,84,275.5627380952380952,0.14964285714285714286

The following query:
- Value Proposition: By identifying the room types that are offered the most in the market by all hotels, as well as other information such as the number of times each type of room has been booked, SuperTravel can better understand the market and make more informed decisions about which room types to offer.
- Pricing Strategy: Understanding which room types are frequently discounted can support more effective pricing and promotional strategies.

In [33]:
#Q7: how many hotels are offering each type of hotel rooms, and how is the room price distributed for each type of hotel rooms?
stmt = """
SELECT 
    room_types.room_type,
    COUNT(room_prices.hotel_id) AS number_of_hotels_offering,
    AVG(room_prices.price) AS average_price,
    MIN(room_prices.discount_ratio) AS minimum_discount_ratio,
    MAX(room_prices.discount_ratio) AS maximum_discount_ratio,
    AVG(room_prices.discount_ratio) AS average_discount_ratio,
    COALESCE(b.room_booking_count, 0) AS number_of_times_booked
FROM 
    room_prices
    JOIN room_types ON room_prices.room_type_id = room_types.room_type_id
    LEFT JOIN (
        SELECT 
            hotel_bookings.room_type,
            COUNT(*) AS room_booking_count
        FROM 
            hotel_bookings
        GROUP BY 
            hotel_bookings.room_type
    ) AS b ON room_prices.room_type_id = b.room_type
GROUP BY 
    room_types.room_type, b.room_booking_count
ORDER BY
    average_discount_ratio DESC
LIMIT 5;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['room_type', 'number_of_hotels_offering', 'average_price', 'minimum_discount_ratio', 'maximum_discount_ratio', 'average_discount_ratio', 'number_of_times_booked'])
temp_df

,room_type,number_of_hotels_offering,average_price,minimum_discount_ratio,maximum_discount_ratio,average_discount_ratio,number_of_times_booked
0,Double,213,282.5819248826291080,0.10,0.20,0.15136150234741784038,169
1,Suite,191,504.4480104712041885,0.10,0.20,0.14869109947643979058,155
2,Deluxe,200,649.3011000000000000,0.10,0.20,0.14780000000000000000,168
3,Family,193,651.1245077720207254,0.10,0.20,0.14756476683937823834,162
4,Single,203,298.4367980295566502,0.10,0.20,0.14738916256157635468,159

The following query: Regional Market Analysis: 
- Understanding the distribution of customers across different states can reveal potential opportunities and challenges in regional markets. This helps in targeting marketing and expansion efforts.

- Consumer Behavior Insights: Analyzing customer loyalty and spending patterns in different states can uncover regional consumer behaviors and preferences.

- Customized Marketing Strategies: Geographical analysis can guide customized marketing and promotional strategies optimized for specific state's customers.

In [34]:
#Q8: How many customers are there in each state, and what is the total spending of customers in each state?
stmt = """
SELECT 
    locations.state,
    COUNT(DISTINCT customers.customer_id) AS number_of_customers,
    AVG(customers.loyalty_degree) AS average_loyalty_degree,
    SUM(payment_information.payment) AS total_spending
FROM 
    customers
    JOIN locations ON customers.customer_address = locations.location_id
    JOIN payment_information ON customers.customer_id = payment_information.customer_id
WHERE
    locations.country = 'United States'
GROUP BY 
    locations.state
ORDER BY
    number_of_customers DESC;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['state', 'number_of_customers', 'average_loyalty_degree', 'total_spending'])
temp_df

             state  number_of_customers average_loyalty_degree total_spending
0       California                  215     3.0326295585412668      316469.55
1         New York                  127     3.0484140233722871      180838.50
2            Texas                  107     2.9131886477462437      183606.88
3          Arizona                   59     3.0069444444444444       85836.10
4          Florida                   53     3.1796875000000000       79866.27
5         Colorado                   52     3.1318681318681319       85055.56
6   North Carolina                   45     3.1603375527426160       74262.66
7         Maryland                   37     2.7891891891891892       55350.31
8         Missouri                   35     2.3858695652173913       53175.09
9             Ohio                   33     3.0000000000000000       48821.59
10        Virginia                   29     3.1455696202531646       45034.00
11        Illinois                   24     2.9126984126984127       40154.26
12      Washington                   24     2.8761061946902655       34628.20
13          Oregon                   24     2.4521739130434783       37093.79
14        Nebraska                   22     3.2631578947368421       33471.99
15         Indiana                   22     2.7623762376237624       32952.01
16    Pennsylvania                   21     3.6638655462184874       35429.76
17   Massachusetts                   21     2.1520000000000000       40474.65
18       Wisconsin                   21     3.6875000000000000       28579.29
19         Georgia                   20     3.1456310679611650       33413.77

The following query: 
- Seasonal Sales Performance

In [35]:
#Q9: What is the most popular season for travel?
stmt = """
WITH seasonal_flights AS (
    SELECT 
        CASE 
            WHEN EXTRACT(MONTH FROM departure_time) IN (3, 4, 5) THEN 'Spring'
            WHEN EXTRACT(MONTH FROM departure_time) IN (6, 7, 8) THEN 'Summer'
            WHEN EXTRACT(MONTH FROM departure_time) IN (9, 10, 11) THEN 'Autumn'
            ELSE 'Winter'
        END AS season,
        customer_id
    FROM 
        flight_bookings
        JOIN flight_prices ON flight_bookings.flight_id = flight_prices.flight_id
),
seasonal_hotels AS (
    SELECT 
        CASE 
            WHEN EXTRACT(MONTH FROM check_in_date) IN (3, 4, 5) THEN 'Spring'
            WHEN EXTRACT(MONTH FROM check_in_date) IN (6, 7, 8) THEN 'Summer'
            WHEN EXTRACT(MONTH FROM check_in_date) IN (9, 10, 11) THEN 'Autumn'
            ELSE 'Winter'
        END AS season,
        customer_id
    FROM 
        hotel_bookings
),
seasonal_cars AS (
    SELECT 
        CASE 
            WHEN EXTRACT(MONTH FROM booking_date) IN (3, 4, 5) THEN 'Spring'
            WHEN EXTRACT(MONTH FROM booking_date) IN (6, 7, 8) THEN 'Summer'
            WHEN EXTRACT(MONTH FROM booking_date) IN (9, 10, 11) THEN 'Autumn'
            ELSE 'Winter'
        END AS season,
        customer_id
    FROM 
        car_rental_bookings
)
SELECT 
    COALESCE(sf.season, sh.season, sc.season) AS season,
    COUNT(DISTINCT sf.customer_id) AS flight_sales,
    COUNT(DISTINCT sh.customer_id) AS hotel_sales,
    COUNT(DISTINCT sc.customer_id) AS car_rental_sales
FROM 
    seasonal_flights sf
    FULL JOIN seasonal_hotels sh ON sf.customer_id = sh.customer_id AND sf.season = sh.season
    FULL JOIN seasonal_cars sc ON sf.customer_id = sc.customer_id AND sf.season = sc.season
GROUP BY 
    COALESCE(sf.season, sh.season, sc.season)
ORDER BY
    CASE COALESCE(sf.season, sh.season, sc.season)
        WHEN 'Spring' THEN 1
        WHEN 'Summer' THEN 2
        WHEN 'Autumn' THEN 3
        WHEN 'Winter' THEN 4
        ELSE 5
    END;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['season', 'flight_sales', 'hotel_sales', 'car_rental_sales'])
temp_df

   season  flight_sales  hotel_sales  car_rental_sales
0  Spring           180          188               173
1  Summer           174          169               181
2  Autumn           169          181               171
3  Winter           176          206               178

The following query: 
- Analysis of Customer Satisfaction and Loyalty Relationship

In [36]:
#Q10: : What is the relationship between customer satisfaction (based on reviews) and their loyalties?
stmt = """
SELECT 
    c.loyalty_degree,
    COUNT(r.review_id) AS total_reviews,
    AVG(r.review_score) AS average_review_score,
    SUM(CASE WHEN r.review_score >= 4 THEN 1 ELSE 0 END) AS positive_reviews,
    SUM(CASE WHEN r.review_score < 4 THEN 1 ELSE 0 END) AS negative_reviews,
    MAX(r.review_score) AS highest_review_score,
    MIN(r.review_score) AS lowest_review_score
FROM 
    customers c
    JOIN reviews r ON c.customer_id = r.customer_id
GROUP BY 
    c.loyalty_degree
ORDER BY
    c.loyalty_degree;
"""

temp_df = pd.DataFrame(connection.execute(stmt).fetchall(), columns=['loyalty_degree', 'total_reviews', 'average_review_score', 'positive_reviews', 'negative_reviews', 'highest_review_score', 'lowest_review_score'])
temp_df

,loyalty_degree,total_reviews,average_review_score,positive_reviews,negative_reviews,highest_review_score,lowest_review_score
0,1,85,4.9470588235294118,53,32,9.8,0.1
1,2,100,4.5160000000000000,55,45,9.9,0.0
2,3,76,4.7750000000000000,44,32,9.8,0.0
3,4,63,4.4888888888888889,34,29,9.6,0.2
4,5,80,5.0412500000000000,54,26,9.6,0.2